lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/flash/silent_dfu_flash.c
#include <string.h>
#include "trace.h"
#include "app_section.h"
#include "flash_device.h"
#include "flash_adv_cfg.h"
#include "patch_header_check.h"
#include "platform_utils.h"
#include "hw_aes.h"
#include "rtl876x_hw_aes.h"
#include "os_sync.h"
#include "otp.h"
#include "otp_config.h"
#include "dfu_api.h"
#include "silent_dfu_flash.h"
#include "board.h"

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA
#if ((USER_DATA_START_ADDR & (FMC_BLK_SECTION_LEN - 1)) != 0)
#error "User data start addr is not 64KB Aligned!!"
#endif
#endif

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA2
#if ((USER_DATA2_START_ADDR & (FMC_BLK_SECTION_LEN - 1)) != 0)
#error "User data2 start addr is not 64KB Aligned!!"
#endif
#endif

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
#include "sha256.h"
#include "crc16btx.h"

/*increase buffer size to improvve crc check performance*/
#define CRC_BUFFER_SIZE                 256
#define SHA256_BUFFER_SIZE              256
#define SHA256_LENGTH                   32

#define DFU_UPDATE_LEN                  256
#endif

/*max img num = 16, BIT0: OTA, BIT1: SecureBoot, ..., */
uint16_t valid_bitmap = 0;
PLATFORM_STATIC_ASSERT((IMAGE_MAX - OTA + 1) < (sizeof(valid_bitmap) << 3), valid_bitmap);

uint8_t prev_bp_lv = 0xff;
uint32_t appdefine_offset = 0;

/**
*  @brief: unlock flash is need when erase or write flash.
*/
bool unlock_flash_all(void)
{
    DFU_PRINT_TRACE0("**********[Flash Set] Flash unlock ***********");
    if (FLASH_SUCCESS == flash_sw_protect_unlock_by_addr_locked(0x00800000, &prev_bp_lv))
    {
        DFU_PRINT_TRACE1("[Flash Set] Flash unlock address = 0x800000, prev_bp_lv = %d", prev_bp_lv);
        return true;
    }
    return false;
}

/**
*  @brief: lock flash after erase or write flash.
*/
void lock_flash(void)
{
    if (prev_bp_lv != 0xff)
    {
        flash_set_block_protect_locked(prev_bp_lv);
    }
}

/**
 * @brief erase a sector of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
bool flash_erase_sector(uint32_t addr)
{
    bool result = false;
    result = flash_erase_locked(FLASH_ERASE_SECTOR, addr);
    DFU_PRINT_INFO2("<==dfu flash erase sector: addr=%x, result=%d(1:success)", addr, result);
    return result;
}

/**
 * @brief erase a block of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
bool flash_erase_block(uint32_t addr)
{
    bool result = false;
    result = flash_erase_locked(FLASH_ERASE_BLOCK, addr);
    DFU_PRINT_INFO2("<==dfu flash erase block: addr=%x, result=%d(1:success)", addr, result);
    return result;
}

/**
 * @brief erase a sector of the flash.
 *
 * @param  signature          signature to identify FW.
 * @param  offset             offset of the image.
 * @return  0 if erase successfully, error line number otherwise
*/
uint32_t sil_dfu_flash_erase(uint16_t signature, uint32_t offset)
{
    uint32_t result = 0;
    uint32_t dfu_base_addr;
    dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)signature);
    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (!flash_erase_sector(dfu_base_addr + offset))
    {
        result = __LINE__;
    }

L_Return:
    DFU_PRINT_INFO1("<====sil_dfu_flash_erase: result=%d(0:success)", result);
    return result;
}

uint32_t sil_dfu_flash_check_blank(uint16_t image_id, uint32_t offset, uint16_t size)
{
    uint32_t result = 0;
    DFU_PRINT_INFO3("sil_dfu_flash_check_blank:image_id=0x%x, offset=0x%x, size=%d",
                    image_id, offset, size);
    if (IMAGE_USER_DATA != image_id && IMAGE_USER_DATA2 != image_id)
    {
        uint32_t signal = os_lock(); //need? grace
        /*get start addr from temp addr and use auto mode read to check erase result*/
        result = dfu_flash_check_blank(image_id, offset, size);
        os_unlock(signal);
    }
    else
    {
        uint32_t start_addr = 0;
        if (image_id == IMAGE_USER_DATA)
        {
            start_addr = flash_get_bank_addr(FLASH_BKP_DATA1) + offset;
        }
        else
        {
            start_addr = flash_get_bank_addr(FLASH_BKP_DATA2) + offset;
        }

        for (uint32_t i = 0; i < size / 4; i++)
        {
            uint32_t r_data;
            flash_read_locked(start_addr, 4, (uint8_t *)&r_data);
            if (FMC_ERASE_PATTERN != r_data)
            {
                DFU_PRINT_ERROR2("sil_dfu_flash_check_blank:error! start_addr=0x%x, i=%d", start_addr, i);
                result = __LINE__;
                goto L_Return;
            }
            start_addr += 4;
        }
    }

L_Return:
    DFU_PRINT_INFO1("sil_dfu_flash_check_blank: result=%d", result);
    return result;
}


/**
 * @brief erase a sector of the flash, will retry three times at most
 *
 * @param  signature          signature to identify FW.
 * @param  offset             offset of the image.
 * @return  0 if erase successfully, error line number otherwise,
*/
uint32_t sil_dfu_flash_erase_with_retry(uint16_t image_id, uint32_t offset, uint16_t size)
{
    uint32_t result = 0;
    uint32_t cnt = 0;

    uint32_t dfu_base_addr;
    if (IMAGE_USER_DATA == image_id)
    {
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA1);;
    }
    else if (IMAGE_USER_DATA2 == image_id)
    {
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA2);;
    }
    else
    {
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
    }

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    do
    {
        flash_erase_sector(dfu_base_addr + offset);
        result = sil_dfu_flash_check_blank(image_id, offset, size);

        if (!result)
        {
            //erase ok
            break;
        }
        else
        {
            //retry
            cnt++;
        }
        if (cnt >= 3)
        {
            /*retry three times all fail*/
            goto L_Return;
        }
    }
    while (1);

