lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/flash/silent_dfu_flash.c
        if (image_id == OTA)
        {
            image_size = OTA_HEADER_SIZE;
        }
#ifdef SDK_8772
        else if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
                 || image_id == AppData1 || image_id == AppData2 || image_id == AppData3
                 || image_id == AppData4 || image_id == AppData5 || image_id == AppData6)
#else

#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
        else if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
                 || image_id == AppData1 || image_id == AppData2 || image_id == AppData3
                 || image_id == AppData4 || image_id == AppData5 || image_id == AppData6)
#else
        else if (image_id == SecureBoot || image_id == RomPatch || image_id == AppPatch
                 || image_id == AppData1 || image_id == AppData2)
#endif

#endif
        {
            // auth ota temp bank and get address
            // image_authencation will fail after secure boot, so remove it
            if (!check_header_valid(temp_bank_addr, OTA))
            {
                image_size = 0;
            }
            else
            {
                image_size = HAL_READ32((uint32_t) & ((T_OTA_HEADER_FORMAT *)temp_bank_addr)->secure_boot_size,
                                        (image_id - SecureBoot) * 8);

                //attention: if use old ota header generate tool, app data3-6 addr will be default value 0xffffffff
                if (OTA_HEADER_DEFAULT_VALUE == image_size)
                {
                    image_size = 0;
                }
            }
        }
        else //others will return 0
        {
        }
    }

    return image_size;
}

/**
* @brief check ota image size whether exceed flash layout address.
*/
bool check_dfu_update_image_length(uint16_t signature, uint32_t offset, uint32_t length,
                                   void *p_void, uint32_t *ret)
{
    uint32_t temp_bank_size = 0;
    *ret = 0;

    if (p_void == NULL)
    {
        *ret = __LINE__;
        return false;
    }

    if (IMAGE_USER_DATA == signature)
    {
        temp_bank_size = flash_get_bank_size(FLASH_BKP_DATA1);
    }
    else if (IMAGE_USER_DATA2 == signature)
    {
        temp_bank_size = flash_get_bank_size(FLASH_BKP_DATA2);
    }
    else
    {
        temp_bank_size = get_temp_ota_bank_size_by_img_id((T_IMG_ID)signature);
    }


    if (offset == 0)
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        uint32_t total_length = p_header->payload_len + IMG_HEADER_SIZE;

        if (total_length > temp_bank_size)
        {
            DFU_PRINT_ERROR2("New Image too large! total_length = %d, temp_bank_size = %d", total_length,
                             temp_bank_size);
            *ret = __LINE__;
            return false;
        }
    }

    if (offset + length > temp_bank_size)
    {
        DFU_PRINT_ERROR3("New Image single packet too large! offset = %d, length = %d, temp_bank_size = %d",
                         offset, length, temp_bank_size);
        *ret = __LINE__;
        return false;
    }

    //check pass
    return true;
}


#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
uint32_t sil_dfu_write(uint32_t start_addr, uint32_t length, uint8_t *p_void)
{
    uint32_t result = 0;
    uint16_t loop_cnt = 0;
    uint16_t remain_size = 0;
    uint32_t counter = 0;
    uint8_t s_val[DFU_UPDATE_LEN];

    loop_cnt = length / DFU_UPDATE_LEN;
    remain_size = length % DFU_UPDATE_LEN;
    DFU_PRINT_INFO2("sil_dfu_write: start_addr=0x%x, length=%d",
                    start_addr, length);

    for (int i = 0; i < loop_cnt; i++)
    {
        if (flash_quick_write_locked(start_addr + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN,
                                     p_void + i * DFU_UPDATE_LEN))
        {

            if (flash_split_read_locked(start_addr + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN,
                                        s_val, &counter))
            {

                if (0 != memcmp(s_val, p_void + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN))
                {
                    return __LINE__;
                }
            }
            else
            {
                return __LINE__;
            }
        }
        else
        {
            return __LINE__;
        }
    }

    if (remain_size)
    {
        if (flash_quick_write_locked(start_addr + loop_cnt * DFU_UPDATE_LEN, remain_size,
                                     p_void + loop_cnt * DFU_UPDATE_LEN))
        {
            if (flash_split_read_locked(start_addr + loop_cnt * DFU_UPDATE_LEN,
                                        remain_size, s_val, &counter))
            {
                //ensure p_void is ram addr
                if (0 != memcmp(s_val, p_void + loop_cnt * DFU_UPDATE_LEN, remain_size))
                {
                    return __LINE__;
                }
            }
            else
            {
                return __LINE__;
            }
        }
        else
        {
            return __LINE__;
        }
    }


    return result;
}
#endif

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
static uint32_t img_total_len = 0;
static uint32_t total_block_cnt = 0;
static uint32_t block_cnt = 0;
#endif
/**
 * @brief  write specified image data with specified length to flash
 * @param  signature          signature to identify FW.
 * @param  offset             offset of the image.
 * @param  length             length of data.
 * @param  p_void             pointer to data.
 * @return 0 if write FW image successfully, error line number otherwise
*/
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
uint32_t sil_dfu_update(uint16_t image_id, uint32_t offset, uint32_t length,
                        uint32_t *p_void, bool is_new_image)
#else
uint32_t sil_dfu_update(uint16_t image_id, uint32_t offset, uint32_t length,
                        uint32_t *p_void)
#endif
{
    uint32_t result = 0;
    uint32_t dfu_base_addr;
    uint32_t start_addr;
    bool erase_rst = true; //default value must be true

