lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/flash/silent_dfu_flash.c
    DFU_PRINT_INFO3("====>dfu_update: image_id=0x%x, offset=0x%x, length=%d", image_id, offset,
                    length);

    if (length % 4)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (IMAGE_USER_DATA == image_id)
    {
        /*get back up area address*/
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA1);
    }
    else if (IMAGE_USER_DATA2 == image_id)
    {
        /*get back up area address*/
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA2);
    }
    else
    {
        /*get back up area address*/
#ifdef SDK_8772
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
#else

#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
        dfu_base_addr = flash_ioctl(flash_ioctl_get_temp_bank_addr_by_image_id_ext, (T_IMG_ID)image_id, 0);
#else
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
#endif

#endif
    }

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash layout */
    if (!check_dfu_update_image_length(image_id, offset, length, p_void, &result))
    {
        goto L_Return;
    }

    /*if it's start_packet*/
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
    if (is_new_image)
#else
    if (offset == 0)
#endif
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        /*access ram addr, make sure image is not ready*/
        p_header->ctrl_flag.flag_value.not_ready = 0x1;
        DFU_PRINT_TRACE2("====>dfu_update: New Image Header! image_id=0x%x, dfu_base_addr=0x%x",
                         image_id, dfu_base_addr);

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
        if (IMAGE_USER_DATA == image_id || IMAGE_USER_DATA2 == image_id)
        {
            img_total_len = p_header->payload_len + IMG_HEADER_SIZE;

            if (0 == (dfu_base_addr & (FMC_BLK_SECTION_LEN - 1)))  //start addr 64k align
            {
                total_block_cnt = img_total_len / FMC_BLK_SECTION_LEN;
                DFU_PRINT_TRACE2("<==dfu_update: img_total_len=0x%x, total_block_cnt=%d",
                                 img_total_len, total_block_cnt);
            }
            else
            {
                /*improve user data ota performance with the limitation of start addr aligned 64K*/
                DBG_DIRECT("Error User data start addr not aligned 64K!");

                result = __LINE__;
                goto L_Return;
            }

            if (0 != (img_total_len & (FMC_BLK_SECTION_LEN - 1)))  //img_total_len is not align 64KB
            {
                if (length > FMC_SEC_SECTION_LEN)
                {
                    /*DFU_TEMP_BUFFER_SIZE can't larger than 4KB if user data size not aligned 64KB,
                    otherwise DFU_TEMP_BUFFER_SIZE can't larger than 64KB when user data size aligned 64KB*/
                    DBG_DIRECT("Error DFU_TEMP_BUFFER_SIZE > 4KB");

                    result = __LINE__;
                    goto L_Return;

                }
            }
        }
#endif
    }

    start_addr = dfu_base_addr + offset;

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
    if (IMAGE_USER_DATA == image_id || IMAGE_USER_DATA2 == image_id)
    {
        if (block_cnt < total_block_cnt)
        {
            if (0 == (offset & (FMC_BLK_SECTION_LEN - 1)))   //new Block starts
            {
                erase_rst = flash_erase_block(start_addr);
                block_cnt ++;
            }
            else  // only cross two block
            {
                if (((offset % FMC_BLK_SECTION_LEN) + length > FMC_BLK_SECTION_LEN)
                    && (length <= FMC_BLK_SECTION_LEN))
                {
                    erase_rst = flash_erase_block((start_addr + length) & ~(FMC_BLK_SECTION_LEN - 1));
                    block_cnt ++;
                }
            }
        }
        else
        {
            /*img_total_len is not align 64KB, need erase sector*/
            if (0 != (img_total_len & (FMC_BLK_SECTION_LEN - 1)))
            {
                if (0 == (offset & (FMC_SEC_SECTION_LEN - 1)))   //new sector starts
                {
                    erase_rst = flash_erase_sector(start_addr);
                }
                else  // only cross two sector
                {
                    if (((offset % FMC_SEC_SECTION_LEN) + length > FMC_SEC_SECTION_LEN)
                        && (length <= FMC_SEC_SECTION_LEN))
                    {
                        erase_rst = flash_erase_sector((start_addr + length) & ~(FMC_SEC_SECTION_LEN - 1));
                    }
                }
            }
        }
    }
    else  //other images
    {
        if (0 == (offset & (FMC_SEC_SECTION_LEN - 1)))   //new sector starts
        {
            erase_rst = flash_erase_sector(start_addr);
        }
        else // only cross two sector
        {
            /*write space cross two sector. Note: dfu_base_addr have been 4K align*/
            /*if buffer size more than 4K, may cross more than two sectors*/
            if (((offset % FMC_SEC_SECTION_LEN) + length > FMC_SEC_SECTION_LEN)
                && (length <= FMC_SEC_SECTION_LEN))
            {
                erase_rst = flash_erase_sector((start_addr + length) & ~(FMC_SEC_SECTION_LEN - 1));
            }
        }
    }
#else
    if ((offset % FMC_SEC_SECTION_LEN) == 0)   //new sector starts
    {
        erase_rst = flash_erase_sector(dfu_base_addr + offset);
    }
    else  // cross page
    {
        /*write space cross two sector. Note: dfu_base_addr have been 4K align*/
        /*if buffer size more than 4K, may cross more than two sectors*/
        if (((offset % FMC_SEC_SECTION_LEN) + length > FMC_SEC_SECTION_LEN)
            && (length <= FMC_SEC_SECTION_LEN))
        {
            erase_rst = flash_erase_sector((dfu_base_addr + offset + length) & ~(FMC_SEC_SECTION_LEN - 1));
        }
    }
#endif
    if (!erase_rst)
    {
        //erase fail
        result = __LINE__;
        goto L_Return;
    }

