lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/flash/silent_dfu_flash.c
#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
    result = sil_dfu_write(start_addr, length, (uint8_t *)p_void);
#else
    for (int i = 0; i < length; i = i + 4)
    {
        uint32_t s_val;
        flash_auto_write_locked(start_addr + i, *(uint32_t *)p_void);

        flash_auto_read_locked((start_addr + i) | FLASH_OFFSET_TO_NO_CACHE, &s_val);
        if (s_val != *(uint32_t *)p_void)
        {
            DFU_PRINT_TRACE3("<====dfu_update:error! w_data=0x%x, r_data=0x%x, adddr=0x%x",
                             *(uint32_t *)p_void, s_val, start_addr + i);
            result = __LINE__;
            goto L_Return;
        }
        else
        {
            p_void++;
        }
    }
#endif

L_Return:

    DFU_PRINT_INFO1("<====dfu_update result:%d", result);
    return result;
}

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
static void slient_dfu_read_image_data(uint8_t *dest, uint8_t *sour, uint32_t len)
{
    uint32_t counter = 0;
    if (OTP->image_split_read)
    {
        flash_split_read_locked((uint32_t)sour, len, dest, &counter);  //better performance
    }
    else
    {
        flash_read_locked((uint32_t)sour, len, dest);
    }
}

static uint16_t slient_dfu_process_crc(uint16_t fcs, uint8_t *buf, uint32_t buf_max_size,
                                       uint8_t *pdata,
                                       size_t data_len)
{
    uint16_t loop_cnt = data_len / buf_max_size;
    uint16_t remain_size = data_len % buf_max_size;
    uint16_t i;

    for (i = 0; i < loop_cnt; ++i)
    {
        slient_dfu_read_image_data(buf, pdata, buf_max_size);
        fcs = btxfcs(fcs, buf, buf_max_size);
        pdata += buf_max_size;
    }
    if (remain_size)
    {
        if ((remain_size % 4) == 0)
        {
            slient_dfu_read_image_data(buf, pdata, remain_size);
            fcs = btxfcs(fcs, buf, remain_size);
        }
        else
        {
            fcs = btxfcs(fcs, pdata, remain_size);
        }
    }

    return fcs;
}

/**
 * @brief  calculated CRC checksum over the image, and compared with given checksum value.
 *
 * @param  p_header          image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
bool slient_dfu_check_crc(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    uint8_t buf[CRC_BUFFER_SIZE];
    uint16_t calced_crc16;
    uint16_t img_crc16;
    uint32_t temp;

    uint32_t length = IMG_HEADER_SIZE - DFU_HEADER_SIZE - 256 - 16;
    uint8_t *pdata = (uint8_t *) p_header + DFU_HEADER_SIZE;
    calced_crc16 = slient_dfu_process_crc(BTXFCS_INIT, buf, CRC_BUFFER_SIZE, pdata, length);

    //get payload length
    flash_read_locked((uint32_t)p_header + 8, 4, (uint8_t *)&length);
    length += 16;
    pdata = (uint8_t *) p_header + IMG_HEADER_SIZE - 16;
    calced_crc16 = slient_dfu_process_crc(calced_crc16, buf, CRC_BUFFER_SIZE, pdata, length);

    //get crc16
    flash_read_locked((uint32_t)p_header + 4, 4, (uint8_t *)&temp);
    img_crc16 = temp >> 16;

    DFU_PRINT_INFO2("<====slient_dfu_check_crc: checksum16=0x%04x, expect=0x%04x",
                    calced_crc16, img_crc16);

    return (img_crc16 == calced_crc16);
}


static void slient_dfu_process_sha256(SHA256_CTX *ctx, uint8_t *buf, uint32_t buf_max_size,
                                      uint8_t *pdata,
                                      size_t data_len)
{
    uint16_t loop_cnt = data_len / buf_max_size;
    uint16_t remain_size = data_len % buf_max_size;
    uint16_t i;

    for (i = 0; i < loop_cnt; ++i)
    {
        slient_dfu_read_image_data(buf, pdata, buf_max_size);
        SHA256_Update(ctx, buf, buf_max_size);
        pdata += buf_max_size;
    }
    if (remain_size)
    {
        slient_dfu_read_image_data(buf, pdata, remain_size);
        SHA256_Update(ctx, buf, remain_size);
    }
}


bool slient_dfu_check_sha256(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    SHA256_CTX ctx;
    uint8_t buf[SHA256_BUFFER_SIZE];
    uint8_t sha256sum[SHA256_LENGTH];
    uint8_t sha256img[SHA256_LENGTH];
    uint32_t payload_len = 0;

    SHA256_Init(&ctx);

    uint8_t *pdata = (uint8_t *)p_header + DFU_HEADER_SIZE;
    slient_dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, 360);

    pdata = (uint8_t *)p_header + 404;
    slient_dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, 348);

    pdata = (uint8_t *)p_header + IMG_HEADER_SIZE - 16;
    //get payload length in img header
    flash_read_locked((uint32_t)p_header + 8, 4, (uint8_t *)&payload_len);
    slient_dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, (16 + payload_len));

    SHA256_Final(&ctx, sha256sum);
    //get sha256 in img header
    flash_read_locked((uint32_t)p_header + 372, sizeof(sha256img), sha256img);

    DFU_PRINT_INFO2("slient_dfu_check_sha256: Calculating result: %b %b",
                    TRACE_BINARY(SHA256_LENGTH, sha256sum), TRACE_BINARY(SHA256_LENGTH, sha256img));

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief  calculated checksum(CRC16 or SHA256 determined by image) over the image, and compared
 *         with given checksum value.
 * @param  p_header image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
bool silent_check_image_chksum(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    bool ret;
    uint16_t crc16 = 0;
    uint32_t r_data = 0;
    ret = flash_read_locked((uint32_t)p_header + 4, sizeof(r_data), (uint8_t *)&r_data);
    if (ret)
    {
        crc16 = r_data >> 16;
        DFU_PRINT_INFO1("silent_check_image_chksum: header->crc16=0x%x", crc16);

        if (crc16)
        {
            ret = slient_dfu_check_crc(p_header);
        }
        else
        {
            ret = slient_dfu_check_sha256(p_header);
        }
    }

    return ret;
}
#endif

void dfu_set_image_ready(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /*
    mark image as ready:
    p_appdefine_header->ctrl_flag.flag_value.not_ready = 0;
    there are two reasons we must use user mode API:
    1. support flash larger than 64M bits.
    2. support 4 bit mode: PRM enabled and programming non cache space doesn't supported.
    */
    uint32_t r_data;
    /* need modify p_header->ctrl_flag.not_ready, so first unlock flash bp*/
    unlock_flash_all();
    flash_read_locked((uint32_t)p_header, sizeof(r_data), (uint8_t *)&r_data);
    r_data &= ~BIT23; /* not_ready */
    flash_write_locked((uint32_t)p_header, sizeof(r_data), (uint8_t *)&r_data);
    lock_flash();
}

/**
 * @brief calculate checksum of the image and compare with given checksum value.
 *
 * @param   image_id     signature to identify image.
 * @return  true if the image integrity check passes, false otherwise
*/
#if (SUPPORT_TEMP_COMBINED_OTA == 1)
bool silent_dfu_check_checksum(uint16_t image_id, uint32_t offset)
#else
bool silent_dfu_check_checksum(uint16_t image_id)
#endif
{
    uint32_t error_code = 0;
    bool check_result;
    uint32_t base_addr = 0;
    T_IMG_CTRL_HEADER_FORMAT *p_ota_header;

