lihuashe/seneasy-work/RTL8752CJF-4416-5687/BEE2-SDK-RCU/src/flash/silent_dfu_flash.c
#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
    if ((image_id >= IMAGE_MAX && IMAGE_USER_DATA2 != image_id && IMAGE_USER_DATA != image_id)
        || image_id < OTA)
#else
    if ((image_id > AppData2 && IMAGE_USER_DATA2 != image_id && IMAGE_USER_DATA != image_id)
        || image_id < OTA)
#endif
    {
        error_code = __LINE__;
        goto L_Return;
    }

    silent_dfu_reset(image_id);

    /* because flash_get_bank_addr(FLASH_BKP_DATA1) is not located flash block protect range, needn't unlock bp */
    if (IMAGE_USER_DATA == image_id)
    {
        base_addr = (flash_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE);
    }
    else if (IMAGE_USER_DATA2 == image_id)
    {
        base_addr = (flash_get_bank_addr(FLASH_BKP_DATA2) | FLASH_OFFSET_TO_NO_CACHE);
    }
    else
    {
#if (SUPPORT_OTA_APP_DATA_EXTENSION == 1)
        base_addr = flash_ioctl(flash_ioctl_get_temp_bank_addr_by_image_id_ext, (T_IMG_ID)image_id, 0);
#else
        /* check OTA temp to see if received image is OK.*/
        base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
#endif
    }

    if (base_addr == 0)
    {
        error_code = __LINE__;
        goto L_Return;
    }

#if (SUPPORT_TEMP_COMBINED_OTA == 1)
    if (!is_ota_support_bank_switch())
    {
        base_addr += offset;
    }
#endif

    p_ota_header = (T_IMG_CTRL_HEADER_FORMAT *)base_addr;

#if (SUPPORT_SILENT_OTA_128M_USER_DATA == 1)
    check_result = silent_check_image_chksum(p_ota_header);
#else

    /*use flash auto mode if OTP->image_split_read == 0, can skip flash_lock and unlock*/
    if (OTP->image_split_read)
    {
        flash_lock(FLASH_LOCK_USER_MODE_READ);
    }
    check_result = check_image_chksum(p_ota_header);
    /*flash auto mode when OTP->image_split_read = 0, skip flash_lock and unlock*/
    if (OTP->image_split_read)
    {
        flash_unlock(FLASH_LOCK_USER_MODE_READ);
    }

#endif

    if (!check_result)
    {
        error_code = __LINE__;
        goto L_Return;
    }

L_Return:
    DFU_PRINT_INFO3("<====dfu_check_checksum check_result:%x,ota_tmp address:%x, error_code:%d",
                    check_result, base_addr, error_code);
    if (error_code)
    {
        return false;
    }
    return true;
}

bool silent_dfu_reset(uint16_t image_id)
{
    bool ret = true;
    if (IMAGE_USER_DATA == image_id || IMAGE_USER_DATA2 == image_id)
    {
        appdefine_offset = 0;
    }
    else
    {
        ret = dfu_reset(image_id);
    }
    return ret;
}








